src/QLHeThongComApp/test/TestUyQuyen/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHeThongComApp">
  <soapenv:Body>
    <qlh:UyQuyenOperation>
      <idUyQuyen>1</idUyQuyen>
      <idDuocUyQuyen>2</idDuocUyQuyen>
    </qlh:UyQuyenOperation>
  </soapenv:Body>
</soapenv:Envelope>