src/QLHeThongComApp/test/TestPhanQuyenNguoiDung/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHeThongComApp">
  <soapenv:Body>
    <qlh:PhanQuyenNguoiDungOperation>
      <id_nguoidung>1</id_nguoidung>
      <id_quyen>2</id_quyen>
    </qlh:PhanQuyenNguoiDungOperation>
  </soapenv:Body>
</soapenv:Envelope>