trunk/src/QLHeThongComApp/test/TestDangNhap/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHeThongComApp">
  <soapenv:Body>
    <qlh:DangNhapOperation>
      <username>song</username>
      <password>song</password>
    </qlh:DangNhapOperation>
  </soapenv:Body>
</soapenv:Envelope>