trunk/src/QLHeThongComApp/test/TestXoaNguoiDungNhom/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHeThongComApp">
  <soapenv:Body>
    <qlh:XoaNguoiDung_NhomOperation>
      <idNguoiDung>3</idNguoiDung>
    </qlh:XoaNguoiDung_NhomOperation>
  </soapenv:Body>
</soapenv:Envelope>