trunk/src/QLHeThongComApp/test/TestDoiMatKhau/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHeThongComApp">
  <soapenv:Body>
    <qlh:DoiMatKhauOperation>
      <matKhau>ttt</matKhau>
      <id_nguoidung>2</id_nguoidung>
    </qlh:DoiMatKhauOperation>
  </soapenv:Body>
</soapenv:Envelope>